In [1]:
import pandas as pd

In [2]:
storage_options = {'User-Agent': 'Mozilla/5.0'}
url = "https://en.wikipedia.org/wiki/Apollo_program"

In [3]:
all_dfs = pd.read_html(io=url, storage_options=storage_options)

In [4]:
all_dfs

[                      0                                            1
 0                   NaN                                          NaN
 1      Program overview                             Program overview
 2               Country                                United States
 3          Organization                                         NASA
 4               Purpose                         Crewed lunar landing
 5                Status                                    Completed
 6       Program history                              Program history
 7                  Cost   $25.4 billion (1973)$257 billion (2020)[1]
 8              Duration                                    1961–1972
 9          First flight                         SA-1October 27, 1961
 10  First crewed flight                     Apollo 7October 11, 1968
 11          Last flight                   Apollo 17December 19, 1972
 12            Successes                                           32
 13             Failures                          2 (Apollo 1 and 13)
 14     Partial failures                                 1 (Apollo 6)
 15         Launch sites  Cape KennedyKennedy Space CenterWhite Sands
 16  Vehicle information                          Vehicle information
 17      Crewed vehicles                          Apollo CSMApollo LM
 18      Launch vehicles       Little Joe IISaturn ISaturn IBSaturn V,
                                                     0
 0                             Part of a series on the
 1                         United States space program
 2                                NASAU.S. Space Force
 3   Human spaceflight programs Mercury Gemini Apol...
 4   Robotic spaceflight programs CRS Explorers GLS...
 5   NASA Astronaut Corps Mercury Gemini Apollo Spa...
 6   Spaceports Eastern Range Cape Canaveral Space ...
 7   Space launch vehicles Alpha Antares Atlas V El...
 8   National security space United States Space Fo...
 9   Civil space Department of Energy national labo...
 10  Commercial space industry Astra Ball Aerospace...
 11                                                vte,
    Designation                  Date      LV                     CSM  \
 0       AS-201          Feb 26, 1966  AS-201                 CSM-009
 1       AS-203           Jul 5, 1966  AS-203                       —
 2       AS-202          Aug 25, 1966  AS-202                 CSM-011
 3     Apollo 1          Feb 21, 1967  SA-204                 CSM-012
 4     Apollo 4           Nov 9, 1967  SA-501                 CSM-017
 5     Apollo 5       Jan 22–23, 1968  SA-204                       —
 6     Apollo 6           Apr 4, 1968  SA-502           CM-020 SM-014
 7     Apollo 7       Oct 11–22, 1968  SA-205                 CSM-101
 8     Apollo 8       Dec 21–27, 1968  SA-503                 CSM-103
 9     Apollo 9        Mar 3–13, 1969  SA-504         CSM-104 Gumdrop
 10   Apollo 10       May 18–26, 1969  SA-505   CSM-106 Charlie Brown
 11   Apollo 11       Jul 16–24, 1969  SA-506        CSM-107 Columbia
 12   Apollo 12       Nov 14–24, 1969  SA-507  CSM-108 Yankee Clipper
 13   Apollo 13       Apr 11–17, 1970  SA-508         CSM-109 Odyssey
 14   Apollo 14  Jan 31 – Feb 9, 1971  SA-509      CSM-110 Kitty Hawk
 15   Apollo 15  Jul 26 – Aug 7, 1971  SA-510       CSM-112 Endeavour
 16   Apollo 16       Apr 16–27, 1972  SA-511          CSM-113 Casper
 17   Apollo 17        Dec 7–19, 1972  SA-512         CSM-114 America

                   LM                                             Crew  \
 0                  —                                                —
 1                  —                                                —
 2                  —                                                —
 3                  —            Gus Grissom Ed White Roger B. Chaffee
 4            LTA-10R                                                —
 5               LM-1                                                —
 6             LTA-2R                                                —
 7                  —        Wally Schirra Walt Cunningham Donn Eisele
 8              LTA-B         Frank Borman James Lovell William Anders
 9        LM-3 Spider  James McDivitt  David Scott Russell Schweickart
 10       LM-4 Snoopy         Thomas Stafford John Young Eugene Cernan
 11        LM-5 Eagle       Neil Armstrong Michael Collins Buzz Aldrin
 12     LM-6 Intrepid             Pete Conrad Richard Gordon Alan Bean
 13     LM-7 Aquarius             James Lovell Jack Swigert Fred Haise
 14      LM-8 Antares         Alan Shepard Stuart Roosa Edgar Mitchell
 15      LM-10 Falcon            David Scott Alfred Worden James Irwin
 16       LM-11 Orion            John Young Ken Mattingly Charles Duke
 17  LM-12 Challenger      Eugene Cernan Ronald Evans Harrison Schmitt

                                               Summary
 0   First flight of Saturn IB and Block I CSM; sub...
 1   No spacecraft; observations of liquid hydrogen...
 2          Suborbital flight of CSM to Pacific Ocean.
 3   Not flown. All crew members died in a fire dur...
 4   First test flight of Saturn V, placed a CSM in...
 5   Earth orbital flight test of LM, launched on S...
 6   Uncrewed, second flight of Saturn V, attempted...
 7   First crewed Earth orbital demonstration of Bl...
 8   First crewed flight of Saturn V; First crewed ...
 9   Second crewed flight of Saturn V; First crewed...
 10  Dress rehearsal for first lunar landing; flew ...
 11  First landing, in Tranquility Base, Sea of Tra...
 12  Second landing, in Ocean of Storms near Survey...
 13  Third landing attempt aborted in transit to th...
 14  Third landing, in Fra Mauro formation. Surface...
 15  Fourth landing, in Hadley-Apennine. First exte...
 16  Fifth landing, in Plain of Descartes. Second e...
 17  Only Saturn V night launch. Sixth landing, in ...  ,
                       Project Apollo  Cost (original, billion $)
 0                  Apollo spacecraft                         8.5
 1             Saturn launch vehicles                         9.1
 2  Launch vehicle engine development                         0.9
 3                         Operations                         1.7
 4                          Total R&D                        20.2
 5      Tracking and data acquisition                         0.9
 6                  Ground facilities                         1.8
 7         Operation of installations                         2.5
 8                              Total                        25.4,
                                     vteApollo program  \
 0   List of missions canceled missions List of Apo...
 1                                    Launch complexes
 2                                   Ground facilities
 3                                     Launch vehicles
 4                                Spacecraft and rover
 5                                             Flights
 6                                            Uncrewed
 7                                              Crewed
 8                                  Saturn development
 9                                         Abort tests
 10                                    Pegasus flights
 11                                  Apollo 8 specific
 12                                 Apollo 11 specific
 13                                 Apollo 12 specific
 14                                 Apollo 13 specific
 15                                 Apollo 14 specific
 16                                 Apollo 15 specific
 17                                 Apollo 16 specific
 18                                 Apollo 17 specific
 19                            Post-Apollo capsule use
 20                                            Related
 21      Symbol † indicates failure or partial failure

                                   vteApollo program.1  \
 0   List of missions canceled missions List of Apo...
 1   Launch Complex 34 Launch Complex 37 Launch Com...
 2   Mission Control Center Cape Kennedy Air Force ...
 3    Little Joe II Saturn Saturn I Saturn IB Saturn V
 4   Apollo spacecraft Command and Service Module L...
 5   Uncrewed AS-101 AS-102 AS-201 AS-202 Apollo 4 ...
 6   AS-101 AS-102 AS-201 AS-202 Apollo 4 Apollo 5 ...
 7   Apollo 1† Apollo 7 Apollo 8 Apollo 9 Apollo 10...
 8   Saturn-Apollo 1 SA-2 SA-3 SA-4 SA-5 AS-203 Apo...
 9   QTV Pad Abort Test-1 A-001 A-002 A-003 Pad Abo...
 10                               AS-103 AS-104 AS-105
 11                          Earthrise Genesis reading
 12  Command Module Columbia Lunar Module Eagle Tra...
 13  Statio Cognitum Surveyor 3 Surveyor crater Ben...
 14                     "Houston, we've had a problem"
 15  Modular Equipment Transporter Fra Mauro format...
 16  Journey Lunar operations Solo operations Retur...
 17                                          Big Muley
 18  The Blue Marble Taurus–Littrow Tracy's Rock Na...
 19                          Skylab 2 3 4 Apollo–Soyuz
 20  "We choose to go to the Moon" Lunar orbit rend...
 21      Symbol † indicates failure or partial failure

                                   vteApollo program.2
 0   List of missions canceled missions List of Apo...
 1                                                 NaN
 2                                                 NaN
 3                                                 NaN
 4                                                 NaN
 5                                                 NaN
 6                                                 NaN
 7                                                 NaN
 8                                                 NaN
 9                                                 NaN
 10                                                NaN
 11                                                NaN
 12                                                NaN
 13                                                NaN
 14                                                NaN
 15                                                NaN
 16                                                NaN
 17                                                NaN
 18                                                NaN
 19                                                NaN
 20                                                NaN
 21      Symbol † indicates failure or partial failure  ,
                     0                                                  1
 0            Uncrewed  AS-101 AS-102 AS-201 AS-202 Apollo 4 Apollo 5 ...
 1              Crewed  Apollo 1† Apollo 7 Apollo 8 Apollo 9 Apollo 10...
 2  Saturn development  Saturn-Apollo 1 SA-2 SA-3 SA-4 SA-5 AS-203 Apo...
 3         Abort tests  QTV Pad Abort Test-1 A-001 A-002 A-003 Pad Abo...
 4     Pegasus flights                               AS-103 AS-104 AS-105,
          vteApollo program hardware  \
 0                   Launch vehicles
 1         Launch vehicle components
 2                        Spacecraft
 3             Spacecraft components
 4                       Space suits
 5           Lunar surface equipment
 6                    Ground support
 7                        Ceremonial
 8                           Related
 9  Category:Apollo program hardware

                         vteApollo program hardware.1
 0          Little Joe II Saturn I Saturn IB Saturn V
 1  F-1 engine J-2 engine Instrument unit Launch V...
 2  Apollo Apollo command module Columbia Apollo s...
 3  Apollo Abort Guidance System Apollo Docking Me...
 4  Apollo/Skylab A7L Beta cloth Thermal Micromete...
 5  Portable Life Support System Lunar Roving Vehi...
 6  Mobile Launcher Launch Umbilical Tower Crawler...
 7  Lunar plaque Lunar Flag Assembly Fallen Astron...
 8  Biological Cosmic Ray Experiment Lunar escape ...
 9                   Category:Apollo program hardware  ,
              vtePeople who have traveled to the Moon  \
 0                                 Walked on the Moon
 1                   Flew to the Moon without landing
 2  Apollo program Saturn V Command and Service Mo...

            vtePeople who have traveled to the Moon.1
 0  Neil Armstrong (Apollo 11) Buzz Aldrin (Apollo...
 1  William Anders (Apollo 8) Frank Borman (Apollo...
 2  Apollo program Saturn V Command and Service Mo...  ,
   vteUnited States human spaceflight programs  \
 0                                      Active
 1                                   Completed
 2                                    Canceled

        vteUnited States human spaceflight programs.1  \
 0  Artemis International Space Station Commercial...
 1  X-15 Mercury Gemini Apollo Apollo Applications...
 2  Constellation Dyna-Soar HL-20 Personnel Launch...

    vteUnited States human spaceflight programs.2
 0                                            NaN
 1                                            NaN
 2                                            NaN  ,
   vteCrewed spacecraft (programs)  \
 0                          Active
 1                         Retired
 2                  In development
 3                       Cancelled

                    vteCrewed spacecraft (programs).1
 0  China Shenzhou Russia Soyuz United States Crew...
 1  Soviet Union Vostok Voskhod Buran United State...
 2  China Mengzhou Lanyue India Gaganyaan Russia O...
 3                        United States SpaceShip III  ,
                                               vteNASA  \
 0                                  Policy and history
 1                                  History (creation)
 2                                             General
 3                          Human spaceflight programs
 4                                                Past
 5                                             Current
 6                                    Robotic programs
 7                                                Past
 8                                             Current
 9   Individual featured  missions (human and robotic)
 10                                               Past
 11                                Currently operating
 12                                             Future
 13                      Communications and navigation
 14                                         NASA lists
 15                            NASA images and artwork
 16                                            Related
 17                                           Category

                                             vteNASA.1
 0   History (creation) NACA (1915) National Aerona...
 1   NACA (1915) National Aeronautics and Space Act...
 2   Space Race Administrator and Deputy Administra...
 3   Past X-15 (suborbital) Mercury Gemini Apollo S...
 4   X-15 (suborbital) Mercury Gemini Apollo Skylab...
 5   International Space Station Commercial Orbital...
 6   Past Hitchhiker Mariner Mariner Mark II MESUR ...
 7   Hitchhiker Mariner Mariner Mark II MESUR Mars ...
 8   Living With a Star Lunar Precursor Robotic Pro...
 9   Past Apollo 11 COBE Mercury 3 Mercury-Atlas 6 ...
 10  Apollo 11 COBE Mercury 3 Mercury-Atlas 6 Magel...
 11  Mars Reconnaissance Orbiter 2001 Mars Odyssey ...
 12  Nancy Grace Roman Space Telescope DAVINCI VERITAS
 13  Near Earth Network Space Network Deep Space Ne...
 14  Astronauts by name by year Gemini astronauts A...
 15  Earthrise The Blue Marble Family Portrait Pale...
 16  "We choose to go to the Moon" "One small step"...
 17                                           Category  ,
                     0                                                  1
 0  History (creation)  NACA (1915) National Aeronautics and Space Act...
 1             General  Space Race Administrator and Deputy Administra...,
          0                                                  1
 0     Past  X-15 (suborbital) Mercury Gemini Apollo Skylab...
 1  Current  International Space Station Commercial Orbital...,
          0                                                  1
 0     Past  Hitchhiker Mariner Mariner Mark II MESUR Mars ...
 1  Current  Living With a Star Lunar Precursor Robotic Pro...,
                      0                                                  1
 0                 Past  Apollo 11 COBE Mercury 3 Mercury-Atlas 6 Magel...
 1  Currently operating  Mars Reconnaissance Orbiter 2001 Mars Odyssey ...
 2               Future  Nancy Grace Roman Space Telescope DAVINCI VERITAS,
                         vteMoon  \
 0                       Outline
 1           Physical properties
 2                         Orbit
 3          Surface and features
 4                       Science
 5                   Exploration
 6   Time-telling and navigation
 7              Phases and names
 8               Daily phenomena
 9                       Related
 10                     Category

                                             vteMoon.1 vteMoon.2
 0                                             Outline   Outline
 1   Internal structure Topography Atmosphere Gravi...       NaN
 2   Orbital elements Distance Perigee and apogee L...       NaN
 3   Selenography Terminator Limb Hemispheres Near ...       NaN
 4   Observation Libration Lunar theory Origin Gian...       NaN
 5   Missions Apollo program Explorers Probes Landi...       NaN
 6   Lunar calendar Lunisolar calendar Month Lunar ...       NaN
 7   New Full Names Crescent Super and micro Blood ...       NaN
 8                   Moonrise Meridian passage Moonset       NaN
 9   Lunar deities Lunar effect Earth phase Moon il...       NaN
 10                                           Category  Category  ,
                                       vteLunar rovers  \
 0                                              Active
 1                                                Past
 2                                            Lunokhod
 3                                              Apollo
 4                                                CLEP
 5                                         Chandrayaan
 6                                              Rashid
 7                                                CLPS
 8                                                JAXA
 9                                         Ispace Inc.
 10                                            Planned
 11                                           Proposed
 12                                          Cancelled
 13                                            Related
 14  Missions are ordered by launch date. Sign † in...

                                     vteLunar rovers.1
 0                 Yutu-2 (2019–present, on Chang'e 4)
 1   Lunokhod Lunokhod 0 (1A)† (1969) Lunokhod 1 (1...
 2   Lunokhod 0 (1A)† (1969) Lunokhod 1 (1970–1971,...
 3   Lunar Roving Vehicle (1971, Apollo 15) LRV-2 (...
 4   Yutu (2013–2016, on Chang'e 3) Yidong Xiangji ...
 5   Pragyan† (2019, on Chandrayaan-2) Pragyan (202...
 6          Rashid† (2022–2023, on Hakuto-R Mission 1)
 7   Iris† (2024, on Peregrine Mission One) Colmena...
 8   Sora-Q† (2022–2023, on Hakuto-R Mission 1) LEV...
 9              TENACIOUS (2025 on Hakuto-R Mission 2)
 10  Chang'e 7 Rashid 2 (2026 on Blue Ghost Mission...
 11  ATHLETE Audi Lunar Quattro ×2 (PTScientists) D...
 12        Lunokhod 3 (1977) Resource Prospector VIPER
 13  Tank on the Moon (2007 documentary) List of mi...
 14  Missions are ordered by launch date. Sign † in...  ,
              0                                                  1
 0     Lunokhod  Lunokhod 0 (1A)† (1969) Lunokhod 1 (1970–1971,...
 1       Apollo  Lunar Roving Vehicle (1971, Apollo 15) LRV-2 (...
 2         CLEP  Yutu (2013–2016, on Chang'e 3) Yidong Xiangji ...
 3  Chandrayaan  Pragyan† (2019, on Chandrayaan-2) Pragyan (202...
 4       Rashid         Rashid† (2022–2023, on Hakuto-R Mission 1)
 5         CLPS  Iris† (2024, on Peregrine Mission One) Colmena...
 6         JAXA  Sora-Q† (2022–2023, on Hakuto-R Mission 1) LEV...
 7  Ispace Inc.             TENACIOUS (2025 on Hakuto-R Mission 2),
                    vteSpacecraft missions to the Moon  \
 0                                Exploration programs

In [5]:
all_dfs[2]

,Designation,Date,LV,CSM,LM,Crew,Summary
0,AS-201,"Feb 26, 1966",AS-201,CSM-009,—,—,First flight of Saturn IB and Block I CSM; sub...
1,AS-203,"Jul 5, 1966",AS-203,—,—,—,No spacecraft; observations of liquid hydrogen...
2,AS-202,"Aug 25, 1966",AS-202,CSM-011,—,—,Suborbital flight of CSM to Pacific Ocean.
3,Apollo 1,"Feb 21, 1967",SA-204,CSM-012,—,Gus Grissom Ed White Roger B. Chaffee,Not flown. All crew members died in a fire dur...
4,Apollo 4,"Nov 9, 1967",SA-501,CSM-017,LTA-10R,—,"First test flight of Saturn V, placed a CSM in..."
5,Apollo 5,"Jan 22–23, 1968",SA-204,—,LM-1,—,"Earth orbital flight test of LM, launched on S..."
6,Apollo 6,"Apr 4, 1968",SA-502,CM-020 SM-014,LTA-2R,—,"Uncrewed, second flight of Saturn V, attempted..."
7,Apollo 7,"Oct 11–22, 1968",SA-205,CSM-101,—,Wally Schirra Walt Cunningham Donn Eisele,First crewed Earth orbital demonstration of Bl...
8,Apollo 8,"Dec 21–27, 1968",SA-503,CSM-103,LTA-B,Frank Borman James Lovell William Anders,First crewed flight of Saturn V; First crewed ...
9,Apollo 9,"Mar 3–13, 1969",SA-504,CSM-104 Gumdrop,LM-3 Spider,James McDivitt David Scott Russell Schweickart,Second crewed flight of Saturn V; First crewed...
10,Apollo 10,"May 18–26, 1969",SA-505,CSM-106 Charlie Brown,LM-4 Snoopy,Thomas Stafford John Young Eugene Cernan,Dress rehearsal for first lunar landing; flew ...
11,Apollo 11,"Jul 16–24, 1969",SA-506,CSM-107 Columbia,LM-5 Eagle,Neil Armstrong Michael Collins Buzz Aldrin,"First landing, in Tranquility Base, Sea of Tra..."
12,Apollo 12,"Nov 14–24, 1969",SA-507,CSM-108 Yankee Clipper,LM-6 Intrepid,Pete Conrad Richard Gordon Alan Bean,"Second landing, in Ocean of Storms near Survey..."
13,Apollo 13,"Apr 11–17, 1970",SA-508,CSM-109 Odyssey,LM-7 Aquarius,James Lovell Jack Swigert Fred Haise,Third landing attempt aborted in transit to th...
14,Apollo 14,"Jan 31 – Feb 9, 1971",SA-509,CSM-110 Kitty Hawk,LM-8 Antares,Alan Shepard Stuart Roosa Edgar Mitchell,"Third landing, in Fra Mauro formation. Surface..."
15,Apollo 15,"Jul 26 – Aug 7, 1971",SA-510,CSM-112 Endeavour,LM-10 Falcon,David Scott Alfred Worden James Irwin,"Fourth landing, in Hadley-Apennine. First exte..."
16,Apollo 16,"Apr 16–27, 1972",SA-511,CSM-113 Casper,LM-11 Orion,John Young Ken Mattingly Charles Duke,"Fifth landing, in Plain of Descartes. Second e..."
17,Apollo 17,"Dec 7–19, 1972",SA-512,CSM-114 America,LM-12 Challenger,Eugene Cernan Ronald Evans Harrison Schmitt,"Only Saturn V night launch. Sixth landing, in ..."

In [6]:
all_dfs[2][['Date','Designation']]

                    Date Designation
0           Feb 26, 1966      AS-201
1            Jul 5, 1966      AS-203
2           Aug 25, 1966      AS-202
3           Feb 21, 1967    Apollo 1
4            Nov 9, 1967    Apollo 4
5        Jan 22–23, 1968    Apollo 5
6            Apr 4, 1968    Apollo 6
7        Oct 11–22, 1968    Apollo 7
8        Dec 21–27, 1968    Apollo 8
9         Mar 3–13, 1969    Apollo 9
10       May 18–26, 1969   Apollo 10
11       Jul 16–24, 1969   Apollo 11
12       Nov 14–24, 1969   Apollo 12
13       Apr 11–17, 1970   Apollo 13
14  Jan 31 – Feb 9, 1971   Apollo 14
15  Jul 26 – Aug 7, 1971   Apollo 15
16       Apr 16–27, 1972   Apollo 16
17        Dec 7–19, 1972   Apollo 17

In [7]:
df = all_dfs[2][['Date','Designation']].copy()

In [8]:
df

                    Date Designation
0           Feb 26, 1966      AS-201
1            Jul 5, 1966      AS-203
2           Aug 25, 1966      AS-202
3           Feb 21, 1967    Apollo 1
4            Nov 9, 1967    Apollo 4
5        Jan 22–23, 1968    Apollo 5
6            Apr 4, 1968    Apollo 6
7        Oct 11–22, 1968    Apollo 7
8        Dec 21–27, 1968    Apollo 8
9         Mar 3–13, 1969    Apollo 9
10       May 18–26, 1969   Apollo 10
11       Jul 16–24, 1969   Apollo 11
12       Nov 14–24, 1969   Apollo 12
13       Apr 11–17, 1970   Apollo 13
14  Jan 31 – Feb 9, 1971   Apollo 14
15  Jul 26 – Aug 7, 1971   Apollo 15
16       Apr 16–27, 1972   Apollo 16
17        Dec 7–19, 1972   Apollo 17

In [9]:
df['Date'].str.replace('(–.+)?,', '', regex=True)

0      Feb 26 1966
1       Jul 5 1966
2      Aug 25 1966
3      Feb 21 1967
4       Nov 9 1967
5      Jan 22 1968
6       Apr 4 1968
7      Oct 11 1968
8      Dec 21 1968
9       Mar 3 1969
10     May 18 1969
11     Jul 16 1969
12     Nov 14 1969
13     Apr 11 1970
14    Jan 31  1971
15    Jul 26  1971
16     Apr 16 1972
17      Dec 7 1972
Name: Date, dtype: object

In [10]:
pd.to_datetime(df['Date'].str.replace('(–.+)?,', '', regex=True))

0    1966-02-26
1    1966-07-05
2    1966-08-25
3    1967-02-21
4    1967-11-09
5    1968-01-22
6    1968-04-04
7    1968-10-11
8    1968-12-21
9    1969-03-03
10   1969-05-18
11   1969-07-16
12   1969-11-14
13   1970-04-11
14   1971-01-31
15   1971-07-26
16   1972-04-16
17   1972-12-07
Name: Date, dtype: datetime64[ns]

In [11]:
df['Date'] = (pd.to_datetime(df['Date'].str.replace('(–.+)?,', '', regex=True)))

In [12]:
df.head(2)

        Date Designation
0 1966-02-26      AS-201
1 1966-07-05      AS-203

In [13]:
df = df.set_index('Date')

In [14]:
df.head(2)

           Designation
Date
1966-02-26      AS-201
1966-07-05      AS-203

In [15]:
df.index

DatetimeIndex(['1966-02-26', '1966-07-05', '1966-08-25', '1967-02-21',
               '1967-11-09', '1968-01-22', '1968-04-04', '1968-10-11',
               '1968-12-21', '1969-03-03', '1969-05-18', '1969-07-16',
               '1969-11-14', '1970-04-11', '1971-01-31', '1971-07-26',
               '1972-04-16', '1972-12-07'],
              dtype='datetime64[ns]', name='Date', freq=None)

In [16]:
df.loc['1970-04-11']

Designation    Apollo 13
Name: 1970-04-11 00:00:00, dtype: object

In [17]:
df.loc['1970-04']

           Designation
Date
1970-04-11   Apollo 13

In [18]:
df.loc['1968']

           Designation
Date
1968-01-22    Apollo 5
1968-04-04    Apollo 6
1968-10-11    Apollo 7
1968-12-21    Apollo 8

In [19]:
df.loc['1971']

           Designation
Date
1971-01-31   Apollo 14
1971-07-26   Apollo 15

In [20]:
df.loc['1968-07-01':'1972-08-31']

           Designation
Date
1968-10-11    Apollo 7
1968-12-21    Apollo 8
1969-03-03    Apollo 9
1969-05-18   Apollo 10
1969-07-16   Apollo 11
1969-11-14   Apollo 12
1970-04-11   Apollo 13
1971-01-31   Apollo 14
1971-07-26   Apollo 15
1972-04-16   Apollo 16

In [21]:
df.loc['1968-07-01':'1972-08-31']

           Designation
Date
1968-10-11    Apollo 7
1968-12-21    Apollo 8
1969-03-03    Apollo 9
1969-05-18   Apollo 10
1969-07-16   Apollo 11
1969-11-14   Apollo 12
1970-04-11   Apollo 13
1971-01-31   Apollo 14
1971-07-26   Apollo 15
1972-04-16   Apollo 16

In [22]:
df.resample('6ME').count()

            Designation
Date
1966-02-28            1
1966-08-31            2
1967-02-28            1
1967-08-31            0
1968-02-29            2
1968-08-31            1
1969-02-28            2
1969-08-31            3
1970-02-28            1
1970-08-31            1
1971-02-28            1
1971-08-31            1
1972-02-29            0
1972-08-31            1
1973-02-28            1

In [23]:
df.sort_index()

           Designation
Date
1966-02-26      AS-201
1966-07-05      AS-203
1966-08-25      AS-202
1967-02-21    Apollo 1
1967-11-09    Apollo 4
1968-01-22    Apollo 5
1968-04-04    Apollo 6
1968-10-11    Apollo 7
1968-12-21    Apollo 8
1969-03-03    Apollo 9
1969-05-18   Apollo 10
1969-07-16   Apollo 11
1969-11-14   Apollo 12
1970-04-11   Apollo 13
1971-01-31   Apollo 14
1971-07-26   Apollo 15
1972-04-16   Apollo 16
1972-12-07   Apollo 17

In [ ]:
df.loc['1966-02-26':'1966-02-28']

           Designation
Date
1966-02-26      AS-201

In [ ]:
df.loc['1966-02-28':'1966-08-31']

           Designation
Date
1966-07-05      AS-203
1966-08-25      AS-202